<template><div><h1 id="📎服务器更新日志" tabindex="-1"><a class="header-anchor" href="#📎服务器更新日志" aria-hidden="true">#</a> 📎服务器更新日志</h1>
<h2 id="🎈2023-4-1-v4-4-1-ver1-1-0-更新日志" tabindex="-1"><a class="header-anchor" href="#🎈2023-4-1-v4-4-1-ver1-1-0-更新日志" aria-hidden="true">#</a> 🎈2023/4/1 v4.4.1(ver1.1.0)更新日志</h2>
<p>【适配】</p>
<p>BDS &amp;&amp; Minecraft BedRock-1.19.73.01</p>
<p>Liteloader 2.12.3</p>
<p>【新增】</p>
<p>高等级呼吸装备可以自由开关夜视效果</p>
<p>【调整】</p>
<p>1.使用1.19.70+的新API，插件在部分场景理论性能表现更好</p>
<p>2.服务器主菜单界面变化</p>
<p>【BUG修复】</p>
<p>1.在新版本无法关闭“欢迎使用控件自定义”界面的bug</p>
<p>2.部分情况出现误报“违规使用自由视角”的bug</p>
<p>3.CDK兑换码修改属性后不生效的bug</p>
<p>4.无法正常生成空岛的bug</p>
<p>5.标题栏无法正常显示的bug</p>
<h2 id="🎈2023-2-2-betav4-2-11更新日志" tabindex="-1"><a class="header-anchor" href="#🎈2023-2-2-betav4-2-11更新日志" aria-hidden="true">#</a> 🎈2023/2/2 BetaV4.2.11更新日志</h2>
<p>【新增】</p>
<p>1.增强对部分作弊项目的检测</p>
<p>2.服务器版本更新至1.19.60</p>
<p>3.服务器封禁插件对接云黑</p>
<p>4.新增home功能，快来设定属于自己的家吧！</p>
<p>5.服务器主菜单新增设置个人传送点功能</p>
<p>【调整】</p>
<p>服务器音乐资源包删除部分音乐</p>
<p>【优化】</p>
<p>1.调整了插件部分对玩家死亡的检测方式</p>
<p>2.优化了插件在特定场景下的性能表现</p>
<p>3.服务器插件适配1.19.60</p>
<p>4.服务器addons包适配1.19.60的API</p>
<h2 id="🎈2023-2-2-betav4-2-2更新日志" tabindex="-1"><a class="header-anchor" href="#🎈2023-2-2-betav4-2-2更新日志" aria-hidden="true">#</a> 🎈2023/2/2 BetaV4.2.2更新日志</h2>
<p>【新增】</p>
<p>点歌插件，让我们在服务器一起点歌吧！</p>
<p>【调整】</p>
<p>“海底世界”空岛暂时下线</p>
<p>【BUG修复】</p>
<p>玩家间无法转账的bug</p>
<h2 id="🎈2023-2-1-betav4-2-1更新日志" tabindex="-1"><a class="header-anchor" href="#🎈2023-2-1-betav4-2-1更新日志" aria-hidden="true">#</a> 🎈2023/2/1 BetaV4.2.1更新日志</h2>
<p>【新增】</p>
<p>1.全新的随机矿场，前往主城与对应NPC交谈消耗40体力开启矿场之旅吧！</p>
<p>2.体力值系统正式上线，离线时间，十分钟回复一格体力值，在线时间一分钟回复一格体力值，体力值上限为160，达到上限后将不自动回复！</p>
<p>3.可以前往&quot;标题栏设置&quot;项目开启体力值显示！</p>
<p>4.在达到一定的氧气值上限后会获得生命回复、锋利！且效果等级会因呼吸装备等级的不同而不同！</p>
<p>5.服务器每小时自动备份一次</p>
<p>【调整】</p>
<p>服务器售卖商店下线&quot;矿石售卖&quot;项目</p>
<p>【优化】</p>
<p>1.优化插件部分性能表现</p>
<p>2.优化玩家转账系统转账逻辑</p>
<p>【BUG修复】</p>
<p>回收商店在回收部分物品时无法正确判断回收数量的bug</p>
<h2 id="🎈2023-1-30-betav4-1-30更新日志" tabindex="-1"><a class="header-anchor" href="#🎈2023-1-30-betav4-1-30更新日志" aria-hidden="true">#</a> 🎈2023/1/30 BetaV4.1.30更新日志</h2>
<p>【新增】</p>
<p>1.在一定的呼吸装备等级下，现在疾跑每秒扣1氧气值</p>
<p>2.在没有达到X1呼吸装备等级下进入下界会有debuff，在没有达到S1呼吸装备等级下进入末地会有debuff</p>
<p>3.在没有达到V级呼吸装备前，每次死亡损失10%的氧气</p>
<p>【调整】</p>
<p>1.物价指数算法采用全新的正态分布算法</p>
<p>2.部分呼吸装备价格上调</p>
<p>3.商店部分物品价格调整</p>
<p>【优化】</p>
<p>1.标题栏刷新频率调整为1s每次</p>
<p>2.日志记录去除不必要的记录项目</p>
<p>【BUG修复】</p>
<p>商店无法正确回收骨头的bug</p>
<h2 id="🎈2023-1-28-betav4-1-28更新日志" tabindex="-1"><a class="header-anchor" href="#🎈2023-1-28-betav4-1-28更新日志" aria-hidden="true">#</a> 🎈2023/1/28 BetaV4.1.28更新日志</h2>
<p>【新增】</p>
<p>1.售卖商店 新增 村民蛋 基础价格12000/个 限时95折</p>
<p>2.回收商店 新增 部分怪物掉落物回收</p>
<p>【优化】</p>
<p>部分UI切换逻辑</p>
<p>【BUG修复】</p>
<p>1.KillItem(服务器掉落物清理插件)无法正常判断日期切换，导致数据丢失的bug</p>
<p>2.服务器部分功能，玩家昵称长度大于14个字符无法正常使用的bug</p>
<h2 id="🎈2023-1-25-betav4-1-25更新日志" tabindex="-1"><a class="header-anchor" href="#🎈2023-1-25-betav4-1-25更新日志" aria-hidden="true">#</a> 🎈2023/1/25 BetaV4.1.25更新日志</h2>
<p>【新增】</p>
<p>【优化】</p>
<h2 id="🎈2023-1-15-betav4-1-15更新日志" tabindex="-1"><a class="header-anchor" href="#🎈2023-1-15-betav4-1-15更新日志" aria-hidden="true">#</a> 🎈2023/1/15 BetaV4.1.15更新日志</h2>
<p>【新增】</p>
<p>1.全功能商店系统</p>
<p>2.全功能回收系统</p>
<p>3.氧气商店、装备商店、氧气值相关设定</p>
<p>【优化】</p>
<p>主世界虚空强制生成方案废除</p>
<h2 id="🎈2022-11-14-betav0-1更新日志" tabindex="-1"><a class="header-anchor" href="#🎈2022-11-14-betav0-1更新日志" aria-hidden="true">#</a> 🎈2022/11/14 BetaV0.1更新日志</h2>
<p>【新增】</p>
<p>1.基于Gametest的空岛位置生成算法</p>
<p>2.可以根据空岛数量直接算出空岛相应的坐标</p>
<p>3.服务器运行基本安装程序</p>
</div></template>


